# Дан первый член A и разность D арифметической прогрессии. Сформировать и
# вывести список размера 10, содержащий 10 первых членов данной прогрессии: A, A
# + D, A + 2*D, A + 3*D, ... .

a = input("Введите стартовое число арифметической прогрессии: ")
while type(a) != int:  # обработка исключений
    try:
        a = int(a)
    except ValueError:
        print("Неправельно ввели!")
        a = input("Введите стартовое число арифметической прогрессии: ")

d = input("Введите разность арифметической прогрессии: ")
while type(d) != int:  # обработка исключений
    try:
        d = int(d)
    except ValueError:
        print("Неправельно ввели!")
        d = input("Введите разность арифметической прогрессии: ")

ar_pr = []
for i in range(10):
    ar_pr.append(a + d * i)

print(ar_pr)