info_teachers = [
    (1, 'Иванов Иван Иванович', '2000-09-15', 'Преподаватель физкультуры', 'Доктор наук', '46 часов в неделю', 56500),
    (2, 'Иванов Иван Иванович', '1999-06-13', 'Преподаватель информатики', 'Кандидат наук', '30 часов в неделю', 49000),
    (3, 'Иванов Иван Иванович', '1994-02-09', 'Преподаватель русского языка', 'Доктор наук', '42 часов в неделю', 65000),
    (4, 'Иванов Иван Иванович', '1999-01-30', 'Преподаватель химии', 'Кандидат наук', '36 часов в неделю', 50000),
    (5, 'Иванов Иван Иванович', '1996-10-05', 'Преподаватель математики', 'Доктор наук', '48 часов в неделю', 61100),
    (6, 'Иванов Иван Иванович', '1987-06-17', 'Преподаватель высшей математики', 'Кандидат наук', '30 часов в неделю', 70800),
    (7, 'Иванов Иван Иванович', '1995-12-18', 'Преподаватель философии', 'Кандидат наук', '32 часов в неделю', 45500),
    (8, 'Иванов Иван Иванович', '1998-09-13', 'Преподаватель истории', 'Кандидат наук', '38 часов в неделю', 44440),
    (9, 'Иванов Иван Иванович', '1989-08-10', 'Преподаватель биологии', 'Доктор наук', '34 часов в неделю', 33000),
    (10, 'Иванов Иван Иванович', '1990-11-25', 'Преподаватель английского языка', 'Доктор наук', '40 часов в неделю', 50000),
]