#Описать функцию TrianglePS(параметры), вычисляющую по стороне a
## Описать функцию TrianglePS(параметры), вычисляющую по стороне a
# равностороннего треугольника его периметр P = 3*a и площадь S = a2 √3/4. С
# помощью этой функции найти периметры и площади трех равносторонних
# треугольников с данными сторонами.


def TrianglePS(a):
    P = 3 * a
    S = (a ** 2) * (3 ** 0.5) / 4
    return P, S


b = input("Введите длину стороны первого треугольника: ")
while type(b) != float:  # обработка исключений
    try:
        b = float(b)
    except ValueError:
        print("Неправильно ввели!")
        b = input("Введите длину стороны первого треугольника: ")

c = input("Введите длину стороны второго треугольника: ")
while type(c) != float:  # обработка исключений
    try:
        c = float(c)
    except ValueError:
        print("Неправильно ввели!")
        c = input("Введите длину стороны второго треугольника: ")

d = input("Введите длину стороны третьего треугольника: ")
while type(d) != float:  # обработка исключений
    try:
        d = float(d)
    except ValueError:
        print("Неправильно ввели!")
        d = input("Введите длину стороны третьего треугольника: ")

p_b, s_b = TrianglePS(b)
p_c, s_c = TrianglePS(c)
p_d, s_d = TrianglePS(d)

print()
print("Периметр первого треугольника равен", p_b)
print("Площадь первого треугольника равен", s_b,)
print()
print("Периметр первого треугольника равен", p_c)
print("Площадь первого треугольника равен", s_c,)
print()
print("Периметр первого треугольника равен", p_d)
print("Площадь первого треугольника равен", s_d,)